Documents/ПриобретениеТоваровУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПриобретениеТоваровУслуг</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КодСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ЗаказПоставщику</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПриобретениеТоваровУслуг/Ext/ObjectModule.bsl
&После("ОбработкаЗаполнения")
Процедура РСК_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//++ РС Консалт: Трофимов Евгений 09.11.2022 Задача 21783
	//e1cib/data/Документ.Задание?ref=9faa675ffab234684f22d326f89dcf89
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("ДокументОснование") Тогда
		Если (ТипЗнч(ДанныеЗаполнения.ДокументОснование) = Тип("ДокументСсылка.ЗаказПоставщику")
			Или ТипЗнч(ДанныеЗаполнения.ДокументОснование) = Тип("Массив")) Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ЗаказПоставщикуТовары.Ссылка КАК ЗаказПоставщику,
				|	ЗаказПоставщикуТовары.КодСтроки КАК КодСтроки,
				|	ЗаказПоставщикуТовары.Серия КАК Серия
				|ИЗ
				|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
				|ГДЕ
				|	ЗаказПоставщикуТовары.Ссылка В(&Ссылка)";
			
			Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения.ДокументОснование);
			Выборка = Запрос.Выполнить().Выбрать();
			Фильтр = Новый Структура("ЗаказПоставщику,КодСтроки");	
			
			Для Каждого Стр Из Товары Цикл
				ЗаполнитьЗначенияСвойств(Фильтр, Стр);
				Выборка.Сбросить();
				Если Выборка.НайтиСледующий(Фильтр) Тогда
					Стр.Серия = Выборка.Серия;
				Иначе
					Стр.Серия = Неопределено;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	//-- КонецЗадачи 21783	
КонецПроцедуры

&После("ПередЗаписью")
Процедура РСК_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//++ РС Консалт: Трофимов Евгений 22.12.2022 Задача 22454
	//e1cib/data/Документ.Задание?ref=b14c6ffbdbd828834649b3741d796378
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РСК_ПартияПоставкиКонтейнеры.Ссылка КАК ПартияПоставки,
		|	РСК_ПартияПоставкиКонтейнеры.ДатаПоступленияНаСклад КАК ДатаПоступленияНаСклад
		|ИЗ
		|	Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РСК_ПартияПоставки.Товары КАК РСК_ПартияПоставкиТовары
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РСК_ПартияПоставки.Контейнеры КАК РСК_ПартияПоставкиКонтейнеры
		|			ПО РСК_ПартияПоставкиТовары.Ссылка = РСК_ПартияПоставкиКонтейнеры.Ссылка
		|				И РСК_ПартияПоставкиТовары.НомерКонтейнера = РСК_ПартияПоставкиКонтейнеры.НомерКонтейнера
		|		ПО ПриобретениеТоваровУслугТовары.ЗаказПоставщику = РСК_ПартияПоставкиТовары.ЗаказПоставщику
		|			И ПриобретениеТоваровУслугТовары.КодСтроки = РСК_ПартияПоставкиТовары.КодСтроки
		|ГДЕ
		|	ПриобретениеТоваровУслугТовары.Ссылка = &Ссылка
		|	И РСК_ПартияПоставкиКонтейнеры.ДокументПриобретения = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДатаПоступления = Выборка.ДатаПоступленияНаСклад;
	КонецЕсли;
	//-- КонецЗадачи 22454	
КонецПроцедуры
